Autodesk.Revit.DB.ParameterCache.#ctor(Element!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,EvaluatedParameter*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
Constructor to create ParameterCache from native Element and EvaluatedParameter

Autodesk.Revit.DB.ParameterCache
This is a proxy class to hold parameter value without unnecessary gcnew the intermediate
object in later access. It is used in performance critical path.
The parameter values are evaluated from the native object directly and stored
in this proxy class for further use in managed layer.